test_results_20251018_185900/ab_balance_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.baiyi-pay.com (be patient).....done


Server Software:        nginx/1.22.1
Server Hostname:        api.baiyi-pay.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api.baiyi-pay.com

Document Path:          /api/v1/merchant/balance
Document Length:        82 bytes

Concurrency Level:      10
Time taken for tests:   4.738 seconds
Complete requests:      100
Failed requests:        99
   (Connect: 0, Receive: 0, Length: 99, Exceptions: 0)
Non-2xx responses:      1
Total transferred:      52764 bytes
Total body sent:        34300
HTML transferred:       6248 bytes
Requests per second:    21.11 [#/sec] (mean)
Time per request:       473.809 [ms] (mean)
Time per request:       47.381 [ms] (mean, across all concurrent requests)
Transfer rate:          10.88 [Kbytes/sec] received
                        7.07 kb/s sent
                        17.94 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      129  303 175.5    255    1181
Processing:    46  112  90.7     87     626
Waiting:       46   92  53.2     81     464
Total:        175  414 203.4    361    1377

Percentage of the requests served within a certain time (ms)
  50%    361
  66%    404
  75%    474
  80%    518
  90%    680
  95%    827
  98%   1237
  99%   1377
 100%   1377 (longest request)