test_results_20251018_185900/ab_create_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.baiyi-pay.com (be patient).....done


Server Software:        nginx/1.22.1
Server Hostname:        api.baiyi-pay.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api.baiyi-pay.com

Document Path:          /api/v1/order/create
Document Length:        94 bytes

Concurrency Level:      10
Time taken for tests:   5.185 seconds
Complete requests:      100
Failed requests:        99
   (Connect: 0, Receive: 0, Length: 99, Exceptions: 0)
Non-2xx responses:      2
Total transferred:      52520 bytes
Total body sent:        57700
HTML transferred:       6288 bytes
Requests per second:    19.29 [#/sec] (mean)
Time per request:       518.479 [ms] (mean)
Time per request:       51.848 [ms] (mean, across all concurrent requests)
Transfer rate:          9.89 [Kbytes/sec] received
                        10.87 kb/s sent
                        20.76 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      121  342 279.0    276    2166
Processing:    46  101  65.0     90     542
Waiting:       45   86  24.6     82     162
Total:        167  443 296.5    376    2232

Percentage of the requests served within a certain time (ms)
  50%    376
  66%    421
  75%    466
  80%    500
  90%    753
  95%   1184
  98%   1491
  99%   2232
 100%   2232 (longest request)