test_results_20251018_185900/ab_query_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.baiyi-pay.com (be patient).....done


Server Software:        nginx/1.22.1
Server Hostname:        api.baiyi-pay.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api.baiyi-pay.com

Document Path:          /api/v1/order/query
Document Length:        82 bytes

Concurrency Level:      10
Time taken for tests:   4.888 seconds
Complete requests:      100
Failed requests:        99
   (Connect: 0, Receive: 0, Length: 99, Exceptions: 0)
Non-2xx responses:      2
Total transferred:      52508 bytes
Total body sent:        38300
HTML transferred:       6276 bytes
Requests per second:    20.46 [#/sec] (mean)
Time per request:       488.769 [ms] (mean)
Time per request:       48.877 [ms] (mean, across all concurrent requests)
Transfer rate:          10.49 [Kbytes/sec] received
                        7.65 kb/s sent
                        18.14 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      125  287 205.9    237    1339
Processing:    47  101 104.1     74     864
Waiting:       47   94  96.9     72     863
Total:        175  388 240.0    313    1448

Percentage of the requests served within a certain time (ms)
  50%    313
  66%    395
  75%    439
  80%    462
  90%    604
  95%   1009
  98%   1322
  99%   1448
 100%   1448 (longest request)