test_results_20251018_185900/stress_create_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.baiyi-pay.com (be patient)


Server Software:        nginx/1.22.1
Server Hostname:        api.baiyi-pay.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api.baiyi-pay.com

Document Path:          /api/v1/order/create
Document Length:        62 bytes

Concurrency Level:      50
Time taken for tests:   6.826 seconds
Complete requests:      500
Failed requests:        62
   (Connect: 0, Receive: 0, Length: 62, Exceptions: 0)
Non-2xx responses:      62
Total transferred:      249128 bytes
Total body sent:        288500
HTML transferred:       32736 bytes
Requests per second:    73.25 [#/sec] (mean)
Time per request:       682.590 [ms] (mean)
Time per request:       13.652 [ms] (mean, across all concurrent requests)
Transfer rate:          35.64 [Kbytes/sec] received
                        41.27 kb/s sent
                        76.92 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      124  357 327.9    241    2743
Processing:    45  132 195.7     82    3303
Waiting:       44   99 161.4     74    3303
Total:        170  489 403.3    343    3654

Percentage of the requests served within a certain time (ms)
  50%    343
  66%    433
  75%    516
  80%    628
  90%   1062
  95%   1400
  98%   1669
  99%   1841
 100%   3654 (longest request)